# 5. Написать программу вычисления значения функции y=f(a) 
x = int(input('Введите x '))
y = 5*x + 2
print(y)