# 19. Определить номер четверти плоскости,
# в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0
x = int(input("Введите x "))
y = int(input("Введите y "))
if x > 0 and y > 0:
    print("1 четверть")
if x < 0 and y > 0:
    print("2 четверть")
if x < 0 and y < 0:
    print("3 четверть")
if x > 0 and y < 0:
    print("4 четверть")
if x == 0 and y == 0:
    print("Начало координатной плоскости")
