# 29. Написать программу вычисления произведения чисел от 1 до N
n = 4
a=1
for i in range(1, n+1):
    a *=i
print(a)