# 22. Найти расстояние между точками в пространстве 2D/3D

x1 = int(input("Введите х1 "))
y1 = int(input("Введите y1 "))
x2 = int(input("Введите х2 "))
y2 = int(input("Введите y2 "))
print("Расстояние между точками равно ", ((x1-x2)**2+(y1-y2)**2)**0,5)